src/main/resources/xml/accommodationFulfillmentServicePort/upgradeResortRoomType/upgradeResortRoomType.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:upgradeResortRoomType>
         <request>
            <!--Optional:-->
            <upgradeRoomDetail>
               <!--Optional:-->
               <startDate>?</startDate>
               <!--Optional:-->
               <endDate>?</endDate>
               <!--Optional:-->
               <travelComponentGroupingId>?</travelComponentGroupingId>
               <!--Optional:-->
               <travelComponentId>?</travelComponentId>
               <!--Optional:-->
               <roomNumber>?</roomNumber>
               <!--Optional:-->
               <packageCode>?</packageCode>
               <!--Optional:-->
               <facilityId>?</facilityId>
               <!--Optional:-->
               <locationId>?</locationId>
               <!--Optional:-->
               <inventoryOverrideReason>?</inventoryOverrideReason>
               <!--Optional:-->
               <inventoryOverrideContactName>?</inventoryOverrideContactName>
               <!--Optional:-->
               <roomTypeCode>?</roomTypeCode>
               <!--Optional:-->
               <freezeId>?</freezeId>
               <!--Optional:-->
               <bypassFreeze>?</bypassFreeze>
               <!--Optional:-->
               <upgradeReason>?</upgradeReason>
               <communicationChannel>?</communicationChannel>
               <salesChannel>?</salesChannel>
               <!--Optional:-->
               <specialNeedsRequested>?</specialNeedsRequested>
            </upgradeRoomDetail>
            <!--Optional:-->
            <upgradeChargeDetail>
               <!--Optional:-->
               <authorizationCode>?</authorizationCode>
               <!--Optional:-->
               <chargeToGuest>?</chargeToGuest>
               <!--Optional:-->
               <noCharge>?</noCharge>
            </upgradeChargeDetail>
            <!--Optional:-->
            <score>?</score>
            <!--Optional:-->
            <scoringCriteria>?</scoringCriteria>
            <!--Optional:-->
            <unassignedRoom>?</unassignedRoom>
            <locationId>?</locationId>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </acc:upgradeResortRoomType>
   </soapenv:Body>
</soapenv:Envelope>
